### Setting Up Your Environment 
Connecting to database

In [27]:
# Import the necessary libraries
import sqlite3
import pandas as pd

# Setting up the database. DO NOT edit the code given below
conn = sqlite3.connect('./database/production3.db')

#### Test Query

In [28]:
query = ''' 
SELECT * 
FROM cheese_production 
LIMIT 5'''
result = pd.read_sql(query, conn)
display(result)

   Year Period Geo_Level  State_ANSI  Commodity_ID Domain      Value
0  2023    APR     STATE           6             6  TOTAL  208807000
1  2023    APR     STATE          16             6  TOTAL   86452000
2  2023    APR     STATE          17             6  TOTAL    5068000
3  2023    APR     STATE          19             6  TOTAL   31512000
4  2023    APR     STATE          27             6  TOTAL   69728000

### Analysis Begin

Find the average honey production for the year 2022.

In [29]:
query = ''' 
SELECT AVG(Value) 
FROM honey_production 
WHERE Year = 2022
'''
result = pd.read_sql(query, conn)
display(result)

   AVG(Value)
0   3133275.0

In [30]:
query = ''' 
SELECT SUM(Value) 
FROM cheese_production 
WHERE Year = 2023
'''
result = pd.read_sql(query, conn)
display(result)

   SUM(Value)
0  4708634000

What number is Iowa?

In [31]:
query = '''
SELECT * 
FROM state_lookup
WHERE State = 'IOWA'
'''
result = pd.read_sql(query, conn)
display(result)

  State  State_ANSI
0  IOWA          19

### Close the Connection

In [16]:
# Close the database connection 
conn.close()